[
    [
        "Which one of the following statements about colour spaces is correct?",
        "A. The RGB colour space is based on human perception of colour.",
        "B. The HSV colour space separates image intensity from colour information.",
        "C. YCbCr is primarily used in computer graphics applications.",
        "D. The L*a*b* colour space cannot be converted to other colour spaces.",
        "", 
        "B"
    ],
    [
        "What is a key advantage of using the HSV colour space over RGB for image segmentation?",
        "A. HSV provides a linear representation of colour.",
        "B. Hue and saturation in HSV are independent of lighting conditions.",
        "C. HSV uses fewer data points to represent colours.",
        "D. RGB is more suitable for detecting shadows.",
        "", 
        "B"
    ],
    [
        "Which channel in the YCbCr colour space represents the chrominance information?",
        "A. Y",
        "B. R",
        "C. Cb and Cr",
        "D. B",
        "", 
        "C"
    ],
    [
        "Which one of the following is a true statement about the L*a*b* colour space?",
        "A. It is not device-independent.",
        "B. It represents colours in terms of lightness and chromaticity components.",
        "C. L*a*b* is only used for black-and-white images.",
        "D. The b* channel represents brightness.",
        "", 
        "B"
    ],
    [
        "What is the primary purpose of using colour spaces in computer vision?",
        "A. To reduce image file size.",
        "B. To standardize colour representation for different devices.",
        "C. To enhance resolution.",
        "D. To convert images to grayscale.",
        "", 
        "B"
    ],
    [
        "Which one of the following transformations is used to enhance the contrast in an image?",
        "A. Log transformation",
        "B. Contrast stretching",
        "C. Histogram equalization",
        "D. Gamma correction",
        "", 
        "B"
    ],
    [
        "How does the power-law transformation affect an image?",
        "A. It brightens the image by applying a linear transformation.",
        "B. It darkens the image by applying a logarithmic scale.",
        "C. It applies a nonlinear transformation to adjust brightness.",
        "D. It enhances the edges by increasing the sharpness.",
        "", 
        "C"
    ],
    [
        "Which one of the following statements about intensity slicing is correct?",
        "A. Intensity slicing is used to change image resolution.",
        "B. It involves mapping specific intensity ranges to desired values.",
        "C. It is equivalent to histogram equalization.",
        "D. Intensity slicing reduces noise in an image.",
        "", 
        "B"
    ],
    [
        "Which of the following operations is a nonlinear intensity transformation?",
        "A. Negative transformation",
        "B. Log transformation",
        "C. Piecewise linear transformation",
        "D. Linear scaling",
        "", 
        "B"
    ],
    [
        "In which scenario would log transformation be most useful?",
        "A. Enhancing contrast in a high dynamic range image",
        "B. Reducing noise in low-light images",
        "C. Compressing the intensity range of a bright image",
        "D. Mapping high intensities to lower output values",
        "", 
        "D"
    ],
    [
        "Which one of the following is a characteristic of Gaussian filtering?",
        "A. It is a non-linear filtering technique.",
        "B. It enhances edges in an image.",
        "C. It smooths images by averaging pixels with a Gaussian kernel.",
        "D. It is best for high-frequency noise removal.",
        "", 
        "C"
    ],
    [
        "What is the main purpose of applying a high-pass filter to an image?",
        "A. To enhance low-frequency components",
        "B. To blur the image",
        "C. To sharpen details by enhancing edges",
        "D. To reduce image size",
        "", 
        "C"
    ],
    [
        "Which one of the following filters is best for reducing salt-and-pepper noise?",
        "A. Gaussian filter",
        "B. Median filter",
        "C. Sobel filter",
        "D. Notch filter",
        "", 
        "B"
    ],
    [
        "What does a low-pass filter do to an image?",
        "A. It sharpens the edges",
        "B. It reduces the resolution",
        "C. It smooths the image by removing high-frequency components",
        "D. It increases the brightness",
        "", 
        "C"
    ],
    [
        "Which type of filtering operation uses a kernel to apply a weighted average to the pixels in its neighborhood?",
        "A. Median filtering",
        "B. Convolution filtering",
        "C. Bilateral filtering",
        "D. Histogram filtering",
        "", 
        "B"
    ],
    [
        "What is the primary goal of using feature descriptors in computer vision?",
        "A. To reduce image file size",
        "B. To identify and describe distinct patterns in images",
        "C. To convert colour images to grayscale",
        "D. To enhance image contrast",
        "", 
        "B"
    ],
    [
        "Which feature descriptor is particularly well-suited for rotation invariance?",
        "A. SIFT",
        "B. Gabor filters",
        "C. Histogram of Oriented Gradients (HOG)",
        "D. PCA",
        "", 
        "A"
    ],
    [
        "Which one of the following is a texture descriptor that captures the spatial relationship of pixels in an image?",
        "A. Colour histogram",
        "B. HOG",
        "C. Gray-level co-occurrence matrix (GLCM)",
        "D. Haar wavelets",
        "", 
        "C"
    ],
    [
        "How does the LBP (Local Binary Pattern) descriptor work?",
        "A. By comparing each pixel with its neighbors and encoding as binary patterns",
        "B. By calculating the gradient magnitude and orientation",
        "C. By representing image texture using wavelets",
        "D. By encoding colour information in the image",
        "", 
        "A"
    ],
    [
        "Which feature descriptor is known for its ability to describe scale and rotation-invariant features?",
        "A. SURF",
        "B. GLCM",
        "C. HOG",
        "D. FAST",
        "", 
        "A"
    ],
    [
        "Which one of the following is a benefit of using random forest classifiers?",
        "A. They are prone to overfitting.",
        "B. They perform well even when individual trees are weak learners.",
        "C. They require less computational power than single decision trees.",
        "D. They cannot handle missing data.",
        "", 
        "B"
    ],
    [
        "How does increasing the number of trees in a random forest affect its performance?",
        "A. It increases overfitting.",
        "B. It typically improves accuracy but increases computational cost.",
        "C. It decreases accuracy but reduces overfitting.",
        "D. It has no impact on performance.",
        "", 
        "B"
    ],
    [
        "What is the role of feature bagging in a random forest?",
        "A. To reduce the dimensionality of the feature space",
        "B. To increase the correlation between trees",
        "C. To provide each tree with a random subset of features for training",
        "D. To enhance the interpretability of the model",
        "", 
        "C"
    ],
    [
        "Which of the following factors does not typically influence the performance of a random forest classifier?",
        "A. Number of trees",
        "B. Number of features considered at each split",
        "C. Depth of individual trees",
        "D. Colour space used in input images",
        "", 
        "D"
    ],
    [
        "How does the random forest algorithm mitigate the risk of overfitting compared to a single decision tree?",
        "A. By pruning branches in trees",
        "B. By using deep trees",
        "C. By averaging the predictions of multiple uncorrelated trees",
        "D. By reducing the dataset size",
        "", 
        "C"
    ],
    [
        "Which one of the following statements best describes the overfitting problem in pattern recognition?",
        "A. The model fits the training data well but generalizes poorly to new data.",
        "B. The model fits both training and new data well.",
        "C. The model does not fit the training data well.",
        "D. The model ignores the training data.",
        "", 
        "A"
    ],
    [
        "Which method is most suitable for reducing overfitting in machine learning models?",
        "A. Increasing model complexity",
        "B. Reducing the size of the training dataset",
        "C. Regularization techniques like L1 or L2",
        "D. Using only linear models",
        "", 
        "C"
    ],
    [
        "How does the k-Nearest Neighbors (kNN) algorithm classify new data points?",
        "A. By finding the single nearest point",
        "B. By averaging the nearest neighbors’ values",
        "C. By voting based on the class of the k nearest neighbors",
        "D. By using decision boundaries",
        "", 
        "C"
    ],
    [
        "What is a key advantage of using an SVM with a non-linear kernel?",
        "A. It requires less data for training",
        "B. It can classify data that is linearly inseparable",
        "C. It reduces computational complexity",
        "D. It always provides 100% accuracy",
        "", 
        "B"
    ],
    [
        "Which one of the following is a characteristic of a well-generalized model?",
        "A. High complexity with high training accuracy",
        "B. Low complexity with low training accuracy",
        "C. Balance between bias and variance",
        "D. High variance with low bias",
        "", 
        "C"
    ]
]
